**INSERT**

روش اول

In [ ]:
USE SQLCLass
GO

CREATE TABLE dbo.City
(
	ID INT,
	Title VARCHAR(50)
)
INSERT INTO [dbo].[City]
VALUES
	(1,'Tehran'),
	(2,'Shiraz')

In [ ]:
INSERT INTO [dbo].[City]
(
	ID,
	Title
)
VALUES
	(3,'Tabriz'),
	(4,'Esfahan')

In [ ]:
SELECT 
	* 
FROM 
	dbo.City

**INSERT** 

روش دوم

In [ ]:
CREATE TABLE dbo.City2
(
	ID INT,
	Title VARCHAR(50)
)

INSERT INTO dbo.City2
(
	ID,
	Title
)
SELECT 
	ID,
	Title
FROM
	dbo.City

In [ ]:

SELECT 
	ID,
	Title
FROM
	dbo.City2

**INSERT**

  

روش سوم

In [ ]:
SELECT 
	*
INTO
	City3
FROM
	City

In [ ]:
SELECT 
	* 
FROM 
	dbo.City3

**UPDATE** 

  

روش اول

In [ ]:
USE SQLCLass
GO

SELECT 
	* 
FROM 
	dbo.City
WHERE
	ID = 1

In [ ]:
UPDATE 	dbo.City
SET 
	Title = 'Rasht'
WHERE
	ID = 1

In [ ]:
SELECT 
	* 
FROM 
	dbo.City
WHERE
	ID = 1

آماده سازی اطلاعات

In [ ]:
USE SQLCLass
GO

CREATE TABLE dbo.Employee
(
	ID INT,
	Name VARCHAR(50),
	CityID INT
)

In [ ]:
INSERT INTO dbo.Employee
VALUES
	(1, 'Ali', 1),
	(2, 'Ahmad', 1),
	(3, 'Hasan', 2),
	(4, 'Hosein', 2),
	(5, 'Akbar', 2),
	(6, 'Reza', 2),
	(7, 'Omid', 3)

In [ ]:
ALTER TABLE dbo.Employee
ADD 
	CityName	VARCHAR(50)

In [ ]:
SELECT 
	*
FROM
	dbo.Employee

In [ ]:
ALTER TABLE dbo.City
ADD EmployeeCount INT

In [ ]:
SELECT 
	*
FROM
	dbo.City

**UPDATE**

  

روش دوم

In [ ]:
SELECT 
	*
FROM 
	[dbo].Employee AS E
INNER JOIN	
	[dbo].[City] AS C
ON
	C.ID = E.CityID

In [ ]:
UPDATE 
	E
SET
	E.CityName = C.Name
FROM 
	[dbo].Employee AS E
INNER JOIN	
	[dbo].[City] AS C
ON
	C.ID = E.CityID

In [ ]:
SELECT 
	*
FROM 
	[dbo].Employee

**UPDATE**

  

روش سوم

In [ ]:
WITH Employee
AS
(
	SELECT 
		CityID,
		COUNT(*) AS Cnt
	FROM 
		[dbo].Employee AS E
	GROUP BY
		CityID
)	

SELECT 
	*
FROM 
	[dbo].[City] AS C
LEFT OUTER JOIN	
	Employee AS E
ON
	C.ID = E.CityID

In [ ]:
WITH Employee
AS
(
	SELECT 
		CityID,
		COUNT(*) AS Cnt
	FROM 
		[dbo].Employee AS E
	GROUP BY
		CityID
)	

UPDATE C
SET 
	C.EmployeeCount = ISNULL(E.Cnt, 0)
FROM 
	[dbo].[City] AS C
LEFT OUTER JOIN	
	Employee AS E
ON
	C.ID = E.CityID

In [ ]:
SELECT 
	*
FROM
	dbo.City

**DELETE**  

  

روش اول

In [ ]:
USE SQLCLass
GO

DELETE dbo.City2

In [ ]:
DELETE 
FROM
	dbo.City3
WHERE
	ID > 2

In [ ]:
SELECT	
	*
FROM
	dbo.City2

In [ ]:
SELECT	
	*
FROM
	dbo.City3

**DELETE**  

  

روش سوم

In [ ]:
USE SQLCLass
GO

SELECT 
	* 
FROM
	dbo.City AS C
LEFT OUTER JOIN	
	dbo.Employee AS E
ON
	C.ID = E.CityID
WHERE
	E.ID IS NULL

In [ ]:
DELETE
	C
FROM
	dbo.City AS C
LEFT OUTER JOIN	
	dbo.Employee AS E
ON
	C.ID = E.CityID
WHERE
	E.ID IS NULL

In [ ]:
SELECT 
	* 
FROM
	dbo.City